ecdr/elua/src/platform/sam34/platform.c
//   Configure the data packet to be transmitted 
	packet_tx.chip        = AT24C_ADDRESS;
	packet_tx.addr[0]     = EEPROM_MEM_ADDR >> 8;
	packet_tx.addr[1]     = EEPROM_MEM_ADDR;
	packet_tx.addr_length = EEPROM_MEM_ADDR_LENGTH;
	packet_tx.buffer      = (uint8_t *) test_data_tx;
	packet_tx.length      = TEST_DATA_LENGTH;

	if (twi_master_write(BOARD_BASE_TWI_EEPROM, &packet_tx) != TWI_SUCCESS) 
  
  */
  lua_assert(false);
  return PLATFORM_ERR;  //? what is return
}

int platform_i2c_send_byte( unsigned id, u8 data )
{
  twi_write_byte(i2c_base[id], data);
  lua_assert(false);
  return ; //? what is return
}

// FIXME: What are send_start and send_stop for?
void platform_i2c_send_start( unsigned id )
{
  lua_assert(false);
}

void platform_i2c_send_stop( unsigned id )
{
  lua_assert(false);
}

// FIXME: What is ack for?
int platform_i2c_recv_byte( unsigned id, int ack )
{
  return twi_read_byte(i2c_base[id]);
}

#endif	// NUM_I2C > 0


// ****************************************************************************
// UART

// FIXME: Think there are only 3 UART/USART on Due
const u32 uart_id[] = { ID_UART, ID_USART0, ID_USART1, ID_USART3};
Usart* const uart_base[] = { (Usart *) UART, USART0, USART1, USART3};

// Only some U(S)ARTs have hardware flow control
const bool no_hw_flow[] = { true, false, false, true };

// Pins
#define PIN_CFG_CTS0  {PIO_PB26_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}
#define PIN_CFG_RTS0  {PIO_PB25_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}
#define PIN_CFG_SCK0  {PIO_PA17_IDX, (PIO_PERIPH_B | PIO_DEFAULT)}

#define PIN_CFG_CTS1  {PIO_PA15_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}
#define PIN_CFG_RTS1  {PIO_PA14_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}
#define PIN_CFG_SCK1  {PIO_PA16_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}

#define PIO_INVALID_IDX 0xFFFF
#define PIN_CFG_NOPIN  {PIO_INVALID_IDX, 0}

// DANGER Will Robinson - Note that this array starts with USART0, not UART so need to use ID-1 as index
// Might be safer to put in dummy record for UART at the beginning

const struct { sam_pin_config rx, tx, cts, rts, sck; } usart_pins[] = {
        {{PIN_USART0_RXD_IDX, PIN_USART0_RXD_FLAGS}, {PIN_USART0_TXD_IDX, PIN_USART0_TXD_FLAGS}, 
          PIN_CFG_CTS0, PIN_CFG_RTS0, PIN_CFG_SCK0},  // USART0
        {{PIN_USART1_RXD_IDX, PIN_USART1_RXD_FLAGS}, {PIN_USART1_TXD_IDX, PIN_USART1_TXD_FLAGS},
          PIN_CFG_CTS1, PIN_CFG_RTS1, PIN_CFG_SCK1},  // USART1
        {{PIN_USART3_RXD_IDX, PIN_USART3_RXD_FLAGS}, {PIN_USART3_TXD_IDX, PIN_USART3_TXD_FLAGS},
          PIN_CFG_NOPIN, PIN_CFG_NOPIN, PIN_CFG_NOPIN}};  // USART3 (note no RTS/CTS)


//PIO_PA8A_URXD
//PIO_PA9A_UTXD 


static void uarts_init()
{
  unsigned i;

  for( i = 0; i < NUM_UART; i ++ )
    sysclk_enable_peripheral_clock(uart_id[i]);
//  sysclk_enable_peripheral_clock(ID_UART);

//  stdio_serial_init(CONF_UART, &uart_serial_options);
}


u32 platform_uart_setup( unsigned id, u32 baud, int databits, int parity, int stopbits )
{
  sam_usart_opt_t usart_settings;

#ifdef BUILD_USB_CDC
  if( id == CDC_UART_ID )
    return 0; //FIXME
#endif

  if( id < NUM_UART )
  {
    usart_settings.baudrate = baud;
    switch( databits )
    {
      case 5:
        usart_settings.char_length = US_MR_CHRL_5_BIT;
        break;
      case 6:
        usart_settings.char_length = US_MR_CHRL_6_BIT;
        break;
      case 7:
        usart_settings.char_length = US_MR_CHRL_7_BIT;
        break;
      case 9:
        usart_settings.char_length = US_MR_MODE9;
        break;
      default:
        usart_settings.char_length = US_MR_CHRL_8_BIT;
        break;
    };
    switch( parity )
    {
      case PLATFORM_UART_PARITY_EVEN:
        usart_settings.parity_type = US_MR_PAR_EVEN;
        break;
      case PLATFORM_UART_PARITY_ODD:
        usart_settings.parity_type = US_MR_PAR_ODD;
        break;
      case PLATFORM_UART_PARITY_MARK:
        usart_settings.parity_type = US_MR_PAR_MARK;
        break;
      case PLATFORM_UART_PARITY_SPACE:
        usart_settings.parity_type = US_MR_PAR_SPACE;
        break;
      default:
        usart_settings.parity_type = US_MR_PAR_NO;
        break;
    };
    switch( stopbits )
    {
      case PLATFORM_UART_STOPBITS_2:
        usart_settings.stop_bits = US_MR_NBSTOP_2_BIT;
        break;
      case PLATFORM_UART_STOPBITS_1_5:
        usart_settings.stop_bits = US_MR_NBSTOP_1_5_BIT;
        break;
      default:
        usart_settings.stop_bits = US_MR_NBSTOP_1_BIT;
        break;
    };
    usart_settings.channel_mode = US_MR_CHMODE_NORMAL;
    
    if (usart_init_rs232(uart_base[id], &usart_settings, platform_cpu_get_frequency()))
      return 0;     // Fixme: Failure

    /* Disable all uart interrupts. */
//    usart_disable_interrupt(uart_base[id], ALL_INTERRUPT_MASK);
  
    usart_enable_tx(uart_base[id]);
    usart_enable_rx(uart_base[id]);

    // Configure pins for ports other than UART0 (assuming UART0 handled by ASF)
    if (id) {
      gpio_configure_pin(usart_pins[id-1].rx.pin, usart_pins[id-1].rx.flags);
      gpio_configure_pin(usart_pins[id-1].tx.pin, usart_pins[id-1].tx.flags);
    };
  }

  return baud;
}

        
void platform_s_uart_send( unsigned id, u8 data )
{
#ifdef BUILD_USB_CDC
  if( id == CDC_UART_ID )
    platform_usb_cdc_send( data );
  else
#endif
  {
    WAIT_WHILE(!usart_is_tx_ready(uart_base[id]));  // FIXME: Should add timeout on wait
    usart_putchar(uart_base[id], data);
  }
}


// platform_s_uart_recv - return character, or -1 for error
int platform_s_uart_recv( unsigned id, timer_data_type timeout )
{
  uint32_t c;

#ifdef BUILD_USB_CDC
  if( id == CDC_UART_ID )
    return platform_usb_cdc_recv( timeout );
#endif

// If character already waiting, don't check timeout, just get it
  if( timeout == 0 || usart_is_rx_ready(uart_base[id]))
    if (!usart_read(uart_base[id], & c))  // Nonblocking read
      return c;
    else
      return -1;
  else
  {
    usart_set_rx_timeout(uart_base[id], timeout);
    usart_start_rx_timeout(uart_base[id]);
    if (!usart_getchar(uart_base[id], & c)) // Wait for character or timeout
      return c;
    else
      return -1;
  }
}


// TODO: Test flow control
int platform_s_uart_set_flow_control( unsigned id, int type )
{
#ifdef BUILD_USB_CDC
  if( id == CDC_UART_ID)
  {
    if (type == PLATFORM_UART_FLOW_NONE)  // FIXME: For now assume that USB CDC doesn't have flow control
      return PLATFORM_OK;
    else
      return PLATFORM_ERR;
  };
#endif
  
  if (no_hw_flow[id])  // UART, USART3 - do not have RTS/CTS
  {
    if (type == PLATFORM_UART_FLOW_NONE)
      return PLATFORM_OK;
    else
      return PLATFORM_ERR;
  };

  if( type != PLATFORM_UART_FLOW_NONE && type != ( PLATFORM_UART_FLOW_RTS | PLATFORM_UART_FLOW_CTS ) )
    return PLATFORM_ERR;

  if( type != PLATFORM_UART_FLOW_NONE ){ // enable pins for UART functionality
      gpio_configure_pin(usart_pins[id-1].rts.pin, usart_pins[id-1].rts.flags);
      gpio_configure_pin(usart_pins[id-1].cts.pin, usart_pins[id-1].cts.flags);
        // From usart.c - usart_init_hw_handshaking()
      uart_base[id]->US_MR = (uart_base[id]->US_MR & ~US_MR_USART_MODE_Msk) | US_MR_USART_MODE_HW_HANDSHAKING;
    }
  else // release pins to GPIO module
    {
      uart_base[id]->US_MR = uart_base[id]->US_MR & ~US_MR_USART_MODE_HW_HANDSHAKING;
      gpio_configure_pin(usart_pins[id-1].rts.pin, PIO_DEFAULT);
      gpio_configure_pin(usart_pins[id-1].cts.pin, PIO_DEFAULT);
    }

