ecdr/elua/src/platform/sam34/platform.c
  return PLATFORM_OK;
}


// ****************************************************************************
// Timers

const u32 timer_id[] = {ID_TC0, ID_TC1, ID_TC2};
Tc * const timer_tc[] = {TC0, TC1, TC2};

static u32 tc_num(unsigned id);
Tc * tc(unsigned id);
u32 tchannel(unsigned id);

// TODO: See if library files provide a name for this
#define PLATFORM_TIMER_COUNT_MAX ( 0xFFFFFFFFUL )


// 3 timer devices, each with 3 channels

// FIXME: NUM_TC or num_tc - Pick one (if it will work, the const might be more type safe)
#define NUM_TC (sizeof(timer_id)/sizeof (u32))
const unsigned num_tc = (sizeof(timer_id)/sizeof(u32));

// Each TC has 3 timer channels
unsigned const channels_per_tc = 3;

// Indicate which module is using each timer
// TODO: Look at other modules that use timers, as timers - ADC, UART (should they also have indicator)?
typedef enum {
  TMODE_UNINIT = 0,
  TMODE_TIMER,
  TMODE_COUNTER,
  TMODE_PWM } timer_mode_t;

timer_mode_t tmode[ NUM_TIMER ] = { TMODE_UNINIT };  // TODO: Or should this be handled up in timer module?

u8 platform_timer_int_periodic_flag[ NUM_TIMER ] = {0};

static uint32_t tmr_div[NUM_TIMER] = { 0 };


// Helper functions

// Return timer device number for given eLua timer ID
static inline u32 tc_num(unsigned id)
{
  return id/channels_per_tc;
}

// Return pointer to Tc for given eLua timer id
Tc * tc(unsigned id)
{
  return timer_tc[tc_num(id)];
}

// channel number from eLua timer id
u32 tchannel(unsigned id) 
{
  return (u32) id - (tc_num(id) * channels_per_tc);
}


static void timers_init()
{
  unsigned i;

  for( i = 0; i < NUM_TC; i ++ )
    pmc_enable_periph_clk(timer_id[i]);
}


static u32 plat_timer_get_clock( unsigned id )
{
  if (tmr_div[id])
    return CPU_FREQUENCY/tmr_div[id];
  else
    return 0;
}


static u32 plat_timer_set_clock(unsigned id, timer_data_type clock, u32 mode)
{
	static uint32_t ul_sysclk;    // FIXME: What static for?
	uint32_t tmr_tcclks;
  ul_sysclk = CPU_FREQUENCY;  /* Get system clock. */
  
  if ( tc_find_mck_divisor(clock, ul_sysclk, &tmr_div[id], &tmr_tcclks, ul_sysclk) )
  {
    tc_init(tc(id), tchannel(id), tmr_tcclks | mode);
    return plat_timer_get_clock( id );
  }
  else  // Could not find suitable divisor
  {
    tmr_div[id] = 0;
    return 0;
  }
}

// Platform functions

void platform_s_timer_delay( unsigned id, timer_data_type delay_us )
{
  timer_data_type final;  // u64?

  final = ( ( u64 )delay_us * plat_timer_get_clock( id ) ) / 1000000;

  if( final == 0) return;
  if( final > PLATFORM_TIMER_COUNT_MAX )
    final = PLATFORM_TIMER_COUNT_MAX;     // FIXME: this isn't right (copied from another platform) - should do rollover instead (on the other hand, unless use u64 for final, this test makes no sense
// TODO: stop timer, set count to 0, start timer
  tc_init( tc(id), tchannel(id), TC_CMR_WAVE);
  tc_start( tc(id), tchannel(id) );
  WAIT_WHILE( ( tc_read_cv(tc(id), tchannel(id)) < final ) );
// TODO: should probably stop the timer (?)
}

// Example code using timer
//	uint32_t ul_div;
//	uint32_t ul_tcclks;
//	static uint32_t ul_sysclk;

	/* Get system clock. */
//	ul_sysclk = CPU_FREQUENCY;

	/* Configure TC for a 50Hz frequency and trigger on RC compare. */
//	tc_find_mck_divisor(TC_FREQ, ul_sysclk, &ul_div, &ul_tcclks, ul_sysclk);
//	tc_init(TC0, 0, ul_tcclks | TC_CMR_CPCTRG);
//	tc_write_rc(TC0, 0, (ul_sysclk / ul_div) / TC_FREQ);

// FIXME: Need to figure out what timer mode to use
//#define TC_MODE_TIMER   
//#define TC_MODE_COUNTER 
//#define TC_MODE_PWM     
  
timer_data_type platform_s_timer_op( unsigned id, int op, timer_data_type data )
{
  u32 res = 0;

  data = data;  // TODO: What is this for?
  switch( op )
  {
    case PLATFORM_TIMER_OP_START:
      tc_start( tc(id), tchannel(id) );
      break;

    case PLATFORM_TIMER_OP_READ:
      res = tc_read_cv( tc(id), tchannel(id) );
      break;

    case PLATFORM_TIMER_OP_SET_CLOCK:
      // Timer mode: Wave, Clear when count reaches register C, Count up to register C, then reset
      //          | TC_IER_CPCS // Interrupt when count reaches register C
      res = plat_timer_set_clock(id, data, TC_CMR_WAVE | TC_CMR_CPCTRG | TC_CMR_WAVSEL_UP_RC );
      if (res)
        tmode[id] = TMODE_TIMER;
      break;
      
    case PLATFORM_TIMER_OP_GET_CLOCK:
      res = plat_timer_get_clock( id );
      break;

    case PLATFORM_TIMER_OP_GET_MAX_CNT:
      res = PLATFORM_TIMER_COUNT_MAX;
      break;
  }
  return res;
}


// TODO: Needs testing

// period_us - period in microseconds, if period = 0, then use maximum possible period (I think that what means)??
// type: PLATFORM_TIMER_INT_CYCLIC or PLATFORM_TIMER_INT_ONESHOT
int platform_s_timer_set_match_int( unsigned id, timer_data_type period_us, int type )
{
  u64 final;

  if( period_us == 0 )  // Might be handled by setting period_us to largest possible period and continue
  {
    tc_stop(tc(id), tchannel(id));
//    tc_disable_interrupt(tc(id), tchannel(id), TC_IDR_CPCS);   // Disable reg C interrupt (would only do if set an interrupt on counter overflow)
    tc_get_status(tc(id), tchannel(id));
    platform_timer_int_periodic_flag[ id ] = type;              // This was ignored in one example - ??
    tc_write_rc(tc(id), tchannel(id), PLATFORM_TIMER_COUNT_MAX); // Or could just drop the register C mode and go to full wave (changing interrupt type).
    // Should set CMR to CPCstop 
    tc_start( tc(id), tchannel(id) );
    return PLATFORM_TIMER_INT_OK;
  } 
  
  final = ( ( u64 )period_us * plat_timer_get_clock( id ) ) / 1000000;
  if ( final == 0 )
    return PLATFORM_TIMER_INT_TOO_SHORT;  
  if ( final > PLATFORM_TIMER_COUNT_MAX )
    return PLATFORM_TIMER_INT_TOO_LONG;
  tc_stop( tc(id), tchannel(id) );
  tc_get_status( tc(id), tchannel(id) );    // Guessing that this clears pending interrupt stats (?) - may not need
  platform_timer_int_periodic_flag[ id ] = type;
  // FIXME: Need to handle one-shot vs. continuous (stop when reaches register C, vs reset)
  // FIXME: Should be more elegant way to handle oneshot - set CMR to reset and keep going when reach CPC
  tc_write_rc( tc(id), tchannel(id), ( u32 )final );  // TODO: Check if that should be final or final - 1
  tc_start( tc(id), tchannel(id) );
  return PLATFORM_TIMER_INT_OK;
}


// *****************
// SysTick timer - interrupt SYSTICKHZ times/second

