ecdr/elua/src/platform/sam34/platform.c
//static volatile u64 g_ms_ticks = 0;   // Workaround in case system timer doesn't work

// interrupt handler
void SysTick_Handler(void)
{
//	g_ms_ticks++;
  cmn_virtual_timer_cb();

  // System timer handling
  cmn_systimer_periodic();
}

u64 platform_timer_sys_raw_read(void)
{
//  return g_ms_ticks;
  return SysTick->LOAD - SysTick->VAL;
}

void platform_timer_sys_disable_int(void)
{
  SysTick->CTRL &= ~(SysTick_CTRL_TICKINT_Msk);   // based on core_cm3.h and stm32 platform.h
//	NVIC_DisableIRQ(SysTick_IRQn);
}

void platform_timer_sys_enable_int(void)
{
  SysTick->CTRL |= SysTick_CTRL_TICKINT_Msk;
//  NVIC_EnableIRQ(SysTick_IRQn);
}

timer_data_type platform_timer_read_sys(void)
{
  return cmn_systimer_get();
}


// ****************************************************************************
// PWMs

#if NUM_PWM > 0


const uint32_t pwm_chan[] = { PWM_CHANNEL_0, PWM_CHANNEL_1, PWM_CHANNEL_2, PWM_CHANNEL_3, 
                              PWM_CHANNEL_4, PWM_CHANNEL_5, PWM_CHANNEL_6, PWM_CHANNEL_7 };

#define PWM_MAX_CLOCK CPU_FREQUENCY

// TODO: Check PWM library see if it exports a constant to replace this
#define PWM_MAX_PERIOD  ((1<<16) - 1)


// PWM clock - master, /1,2,4,8,16,32,64,128,256,512,1024
// clocka, clockb - dividers, each can divide one of above by (1 to 255)

// PWM channel prescalers
const static u32 pwm_div_ctl[] = { PWM_CMR_CPRE_MCK,  PWM_CMR_CPRE_MCK_DIV_2,
  PWM_CMR_CPRE_MCK_DIV_4,   PWM_CMR_CPRE_MCK_DIV_8,   PWM_CMR_CPRE_MCK_DIV_16,
  PWM_CMR_CPRE_MCK_DIV_32,  PWM_CMR_CPRE_MCK_DIV_64,  PWM_CMR_CPRE_MCK_DIV_128, 
  PWM_CMR_CPRE_MCK_DIV_256, PWM_CMR_CPRE_MCK_DIV_512, PWM_CMR_CPRE_MCK_DIV_1024, 
  PWM_CMR_CPRE_CLKA,        PWM_CMR_CPRE_CLKB };

// const static u8 pwm_div_data[] = { 1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024 };
// prescalers[11] = { 1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024 };
#define pwm_prescalers( n ) ( 1 << (n) )

#define PWM_CLOCK_PRE_MAX  11
const unsigned nprescalers = PWM_CLOCK_PRE_MAX;

#define PWM_PRE_CLOCKA (nprescalers)
#define PWM_PRE_CLOCKB (PWM_PRE_CLOCKA+1)
#define PWM_PRE_UNUSED (PWM_CLOCK_PRE_MAX+2)

// FIXME: pwm_chan_clock and pwm_chan_pre may be redundant? (only need one or other)
// Clock each channel is using
u32 pwm_chan_clock[NUM_PWM] = { 0 };

// Prescaler used by each channel
u8 pwm_chan_pre[NUM_PWM] = { PWM_PRE_UNUSED };

// Use counters - how many channels using each custom clock (if no channels using, can change clock)
u8 pwm_clka_users = 0, pwm_clkb_users = 0;

// Frequency for custom channel clocks
pwm_clock_t pwm_clock = { .ul_clka = 0, .ul_clkb = 0 };


// void PWM_Handler(void)


/* Helper functions */

#define FREQ_EPSILON  100

// Scaler for relative difference (100 would be % difference)
#define PWM_PARTS_PER 1000

// TODO: Use relative difference, rather than absolute difference in clock selection
static int rel_diff(u32 f1, u32 f2)
{
  return (PWM_PARTS_PER * 2 * (f1 - f2)) / (f1 + f2);
}

/*
 * Helper function:
 * Find a prescaler to generate the closest available clock frequency.
 * If the configuration cannot be met (because freq is too high), set the
 * maximum frequency possible.
 */
static u32 pwm_find_clock_prescaler( u32 frequency )
{
  unsigned prescaler;	// Which of the prescalers are we considering?

  if ( frequency > PWM_MAX_CLOCK )
    return 0; // Select master clock frequency

  for (prescaler = 1; prescaler < nprescalers; prescaler++)
    if ( pwm_prescalers( prescaler ) * frequency > PWM_MAX_CLOCK)
      break;
//  Assert( max/prescalers( prescaler-1) > frequency > max/prescalers(prescaler) or prescaler = nprescalers )
//  if ( prescaler < nprescalers )    
// Taking the absolute values of the differences in following comparison handles case where prescaler==nprescalers
    if ( abs(PWM_MAX_CLOCK - frequency * pwm_prescalers( prescaler-1 )) < abs(frequency * pwm_prescalers( prescaler ) - PWM_MAX_CLOCK))
//    ABSDIFF(max, frequency * pwm_prescalers( prescaler-1 )) < ABSDIFF(max, frequency * pwm_prescalers( prescaler ))
      return prescaler - 1;
    else
      return prescaler;
}

// Return the frequency of master clock divided by 2 ^ given prescaler
static u32 freq_from_prescaler( unsigned prescaler )
{
  return PWM_MAX_CLOCK >> prescaler;
}


static int pwm_enable_pin(unsigned id);

// For now - just provide a way to initialize fixed pins for PWM (where can fill in which pin to use)

u8 pwm_pin_enabled[NUM_PWM] = {false};


// set mapping PWM channel -> pin (or pin -> PWM channel)

// 8 PWMs (0-7), each have 2 outputs (H, L) [appear to be at least approximately complementary]
//   also some have one input FI (0-2)
// Output signals can be mapped to various pins
// PWMH0 - PA8(B), PB12(B), PC3(B)
// PIN_ATTR_PWM
/*  
PIO_PA5B_PWMFI0
PIO_PA3B_PWMFI1
PIO_PD6B_PWMFI2 
*/

// Alternate pin selection (FIXME: should use a general pin map at runtime)

// Define these constants to port letter of pin to be used.  
// Define to something else (e.g. nil) if don't want to use.

// TODO: Could make these selectable from the build system
//  e.g., pwm = {L0 = A, L1 = C, ...}

// Allow outside pin definition (shortcut for now - assume if define 1, then defined all)
#ifndef PWML0

// PWML0 A -> onboard LED "Tx" (low = on)
#define PWML0 'A'
#define PWML1 'C'
#define PWML2 'C'
#define PWML3 'C'
// PWML4 C -> arduino pin "PWM9"
#define PWML4 'C'
// PWML5 C -> arduino pin "PWM8"
#define PWML5 'C'
// PWML6 C -> arduino pin "PWM7"
#define PWML6 'C'
// PWML7 C -> arduino pin "PWM6"
#define PWML7 'C'

#endif

// TODO: Remove #warnings below - were just there for testing

static const sam_pin_config pwm_pins_l[] = {
#if ('A' == PWML0)
  { PIO_PA21_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML0 - onboard LED Tx (low = on?)
#elif ('B' == PWML0)
  { PIO_PB16_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML0  PIO_PB16B_PWML0
#elif ('C' == PWML0)
  { PIO_PC2_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},  //PWML0
#else
  PIN_CFG_NOPIN, 
//#warning PWML0 not used
#endif
#if ('A' == PWML1)
  { PIO_PA12_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML1
#elif ('B' == PWML1)
  { PIO_PB17_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML1
#elif ('C' == PWML1)
  { PIO_PC4_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML1
#else
  PIN_CFG_NOPIN, 
//#warning PWML1 not used
#endif

#if ('A' == PWML2)
  { PIO_PA20_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWML2)
  { PIO_PB18_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML2)
  { PIO_PC6_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWML2 not used
#endif // PWML2

