ecdr/elua/src/platform/sam34/platform.c
#if ('A' == PWML3)
  { PIO_PA0_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWML3)
  { PIO_PB19_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML3)
  { PIO_PC8_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)}, // PWML3
#else
  PIN_CFG_NOPIN, 
//#warning PWML3 not used
#endif // PWML3

#if ('B' == PWML4)
  { PIO_PB6_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML4)
  { PIO_PC21_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, // PWML4
#else
  PIN_CFG_NOPIN, 
//#warning PWML4 not used
#endif // PWML4

#if ('B' == PWML5)
  { PIO_PB7_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML5)
  { PIO_PC22_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, // PWML5
#else
  PIN_CFG_NOPIN, 
//#warning PWML5 not used
#endif // PWML5

#if ('B' == PWML6)
  { PIO_PB8_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML6)
  { PIO_PC23_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, // PWML6
#else
  PIN_CFG_NOPIN, 
//#warning PWML6 not used
#endif // PWML6

#if ('B' == PWML7)
  { PIO_PB9_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML7)
  { PIO_PC24_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}  // PWML7
#else
  PIN_CFG_NOPIN 
//#warning PWML7 not used
#endif // PWML7
  };


#ifndef PWMH0

#define PWMH no
//#define PWMH 'C'

#define PWMH0 PWMH
#define PWMH1 PWMH
#define PWMH2 PWMH
#define PWMH3 PWMH
#define PWMH4 no
#define PWMH5 PWMH
#define PWMH6 PWMH

#endif

static const sam_pin_config pwm_pins_h[] = {
#if ('A' == PWMH0)
  { PIO_PA8_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWMH0)
  { PIO_PB12_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWMH0)
  { PIO_PC3_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH0 not used
#endif

#if ('A' == PWMH1)
  { PIO_PA19_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWMH1)
  { PIO_PB13_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWMH1)
  { PIO_PC5_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH1 not used
#endif

#if ('A' == PWMH2)
  { PIO_PA13_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWMH2)
  { PIO_PB14_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWMH2)
  { PIO_PC7_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH2 not used
#endif // PWMH2

#if ('A' == PWMH3)
  { PIO_PA9_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWMH3)
  { PIO_PB15_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWMH3)
  { PIO_PC9_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH3 not used
#endif // PWMH3

#if ('C' == PWMH4)
  { PIO_PC20_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH4 not used
#endif // PWMH4

#if ('C' == PWMH5)
  { PIO_PC19_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH5 not used
#endif // PWMH5

#if ('C' == PWMH6)
  { PIO_PC18_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH6 not used
#endif // PWMH6

  PIN_CFG_NOPIN 
  };


static int pwm_enable_pin(unsigned id)
{
  if (!pwm_pin_enabled[id]) {
		// Setup PWM for pins on this PWM
    if ( pwm_pins_l[id].pin != PIO_INVALID_IDX)
      gpio_configure_pin(pwm_pins_l[id].pin, pwm_pins_l[id].flags);
    if ( pwm_pins_h[id].pin != PIO_INVALID_IDX)
      gpio_configure_pin(pwm_pins_h[id].pin, pwm_pins_h[id].flags);
    pwm_pin_enabled[id] = true;
  }
  return 0; // Return 0 for success
}


// ********************
// PWMs provided by timers
// NUM_TIMER_PWM - number of PWMs done by timers

//#define TIMER_PWM

#ifdef TIMER_PWM

#define MAX_DUTY  100


// TIO pins
// FIXME: Fill in pin id and flags for TIO
static const sam_pin_config pwm_tc_pins[]  = {
  };

// TODO: Flags -> bitarray?
static u8 tc_pinEnabled[NUM_TIMER_PWM] = { 0 };

// Really indexed by number of pseudo-pwms, or maybe by channel number
static struct { u8 mode, running; } TCChan[NUM_TIMER_PWM] = {{0, 0}};
#define TC_PWM 1


/*
static u32 tc_pwm_get_clock( unsigned id );
static u32 tc_pwm_set_clock( unsigned id, u32 clock );
static u32 tc_pwm_setup( unsigned id, u32 frequency, unsigned duty );
static void tc_pwm_start( unsigned id );
static void tc_pwm_stop( unsigned id );
*/

// Timer PWM Helper functions

// Differentiate PWMs handled by pwm vs. by timer (or other mechanism)
static bool pwm_id_is_pwm( unsigned id )
{
  return id < NUM_REAL_PWM;
}

#define INVALID_PWM NUM_PWM

// Map PWM id to id of timer that controls that PWM
// pwm_id -> tc (0-3), tc channel (0-3), A or B
//0: TC0, Ch0, A; 1: TC0, Ch0, B; 2: TC0, Ch1, A; TC0, Ch1, B

// FIXME: Need to clarify terms - make standard term for each of these and fix code appropriately
//  timer device number (TC0, TC1, TC2) 
//  channel number (0-3 - channel handeled by the timer device)
//  pwm_id
//  subchanel (A or B) since each timer can handle 2 PWM pins

static unsigned pwm_id_to_pwm_tc( unsigned id )
{
  if (pwm_id_is_pwm(id))
    return INVALID_PWM;
  return id - NUM_REAL_PWM;
}

static inline unsigned pwm_tc_id_to_timer_id( unsigned id )
{
  return (id >> 1);
}

//  timer_id - id number for the timer (same as in timer module) (e.g. [0-9]
static unsigned pwm_id_to_timer_id( unsigned id )
{
  return pwm_tc_id_to_timer_id(pwm_id_to_pwm_tc(id));
}

// TODO: Could do this with table lookups, which faster/better space?
static unsigned pwm_tc_id_to_timer( unsigned id )
{
  return pwm_tc_id_to_timer_id(id) / channels_per_tc;
}

static unsigned pwm_tc_id_to_channel( unsigned id )
{
  return pwm_tc_id_to_timer_id(id) - (pwm_tc_id_to_timer( id ) * channels_per_tc);
}

static bool pwm_tc_id_isA( unsigned id)
{
  return !(id & 1);
}



// TODO: See how many places used, may be easy to get rid of this
static u32 tc_pwm_get_clock( unsigned id )
{
  return plat_timer_get_clock( pwm_id_to_timer_id( id ) );
}


// TODO: Add error checking on setup (so don't change timer in use for one thing to something else)
static u32 tc_pwm_set_clock( unsigned id, u32 clock )
{
  unsigned timer_id = pwm_id_to_timer_id( id );
  const u32 res = plat_timer_set_clock(timer_id, clock, 
      TC_CMR_TCCLKS_TIMER_CLOCK1 |  // FIXME: Not sure what this does
      TC_CMR_WAVE |         // Waveform mode
      TC_CMR_WAVSEL_UP_RC | // Counter running up and reset when equals to RC
      TC_CMR_EEVT_XC0 |     // Set external events from XC0 (this setup TIOB as output)
      TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_CLEAR | // clear TIOA on RA and RC
      TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_CLEAR); // clear TIOB on RB and RC;
  
