ecdr/elua/src/platform/sam34/platform.c
  if (res)
    tmode[timer_id] = TMODE_PWM;
  return res;
}


static void tc_SetCMR_ChannelA(Tc *tc, uint32_t chan, uint32_t v)
{
	tc->TC_CHANNEL[chan].TC_CMR = (tc->TC_CHANNEL[chan].TC_CMR & 0xFFF0FFFF) | v;
}
// ~ (TC_CMR_ACPA_Msk | TC_CMR_ACPC_Msk)

static void tc_SetCMR_ChannelB(Tc *tc, uint32_t chan, uint32_t v)
{
	tc->TC_CHANNEL[chan].TC_CMR = (tc->TC_CHANNEL[chan].TC_CMR & 0xF0FFFFFF) | v;
}
// ~ (TC_CMR_BCPB_Msk | TC_CMR_BCPC_Msk)


static u32 tc_pwm_setup( unsigned id, u32 frequency, unsigned duty )
{
  const u32 tcid = pwm_id_to_pwm_tc(id);  
  Tc *chTC = tc(pwm_tc_id_to_timer(tcid));
  const uint32_t chNo = pwm_tc_id_to_channel(tcid);
  u32 period;
  u32 duty_clocks;
  const unsigned timer_id = pwm_id_to_timer_id(id);
  
  // Check that timer set up for PWM
  if (tmode[timer_id] != TMODE_PWM)
    return 0;   // FIXME: Or whatever indicates failure

    period = (tc_pwm_get_clock( id ) + frequency/2) / frequency;
  if (period > PLATFORM_TIMER_COUNT_MAX) period = PLATFORM_TIMER_COUNT_MAX;
  duty_clocks = (period * duty + (MAX_DUTY/2) ) / MAX_DUTY; // duty::100 as duty_clocks::period Calculate from duty cycle
  
	if (!TCChan[timer_id].mode) { 
    // Init handled by pwm_set_clock
/*    tc_init(chTC, chNo,
      TC_CMR_TCCLKS_TIMER_CLOCK1 |
      TC_CMR_WAVE |         // Waveform mode
      TC_CMR_WAVSEL_UP_RC | // Counter running up and reset when equals to RC
      TC_CMR_EEVT_XC0 |     // Set external events from XC0 (this setup TIOB as output)
      TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_CLEAR | // clear TIOA on RA and RC
      TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_CLEAR); // clear TIOB on RB and RC */
    tc_write_rc(chTC, chNo, period);

		TCChan[timer_id].mode = TC_PWM;   // FIXME: Not right yet - have we programmed it, then have we started it (so need more than 2 states, or maybe 2 separate flags)  Programmed, started
	}
  else 
    // Check period against frequency currently using, if set to different freq - have a problem
    // Actually this isn't right - need to check that the other channel is in use
    // Or maybe just let them run one PWM per TC (and pick which pin they want A or B)
    if (period != tc_read_rc(chTC, chNo))
      return 0;   // FIXME: Or whatever indicates failure

  if (duty_clocks == 0) {
    if (pwm_tc_id_isA(tcid))
      tc_SetCMR_ChannelA(chTC, chNo, TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_CLEAR);  // RA -> clear TIOA, RC -> clear TIOA
    else
      tc_SetCMR_ChannelB(chTC, chNo, TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_CLEAR);
  } else {
    if (pwm_tc_id_isA(tcid)) {
      tc_write_ra(chTC, chNo, duty_clocks);
      tc_SetCMR_ChannelA(chTC, chNo, TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_SET);  // RA -> clear TIOA, RC -> set TIOA
    } else {
      tc_write_rb(chTC, chNo, duty_clocks);
      tc_SetCMR_ChannelB(chTC, chNo, TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_SET);
    }
  }
//  return (pwmclk + period/2) / period;  
  return ; // what?
}


static void tc_pwm_start( unsigned id )
{
  u32 tcid = pwm_id_to_pwm_tc(id);
  const unsigned timer_id = pwm_id_to_timer_id(id);
  
  if (!tc_pinEnabled[tcid]) {
    if ( pwm_tc_pins[tcid].pin != PIO_INVALID_IDX)
      gpio_configure_pin(pwm_tc_pins[tcid].pin, pwm_tc_pins[tcid].flags);
    tc_pinEnabled[tcid] = 1;
  };

  if (!TCChan[timer_id].running) {
    tc_start(tc(timer_id), pwm_tc_id_to_channel(tcid));
    TCChan[timer_id].running = 1;
  };
}


static void tc_pwm_stop( unsigned id )
{
  u32 tcid = pwm_id_to_pwm_tc(id);
  const unsigned timer_id = pwm_id_to_timer_id(id);

  // FIXME: This doesn't quite work - since the other pin in the channel could still be in use
  // Really what need to do is check if other pin in use, 
  //    if so, then disable this pin (disconnect output from timer, or reprogram register, or ??)
  //    if not, then stop the channel - and release it back to being a timer channel again
  if (TCChan[timer_id].running) {
    tc_stop(tc(timer_id), pwm_tc_id_to_channel(tcid));
    TCChan[timer_id].running = 0;
  };
}

#else

static bool pwm_id_is_pwm( unsigned id )
{
  return true;
}

#endif // TIMER_PWM


// Platform functions

// Assumes that timers enabled by timer section
static void pwms_init( void )
{
  pmc_enable_periph_clk(ID_PWM);
}


#define GET_FIELD(value, mask, pos) ((mask & (value)) >> pos)

//#define PWM_CLK_DIVA_GET(value) ((PWM_CLK_DIVA_Msk & (value)) >> PWM_CLK_DIVA_Pos)))
#define PWM_CLK_DIVA_GET(value) GET_FIELD(value, PWM_CLK_DIVA_Msk, PWM_CLK_DIVA_Pos)
#define PWM_CLK_DIVB_GET(value) GET_FIELD(value, PWM_CLK_DIVB_Msk, PWM_CLK_DIVB_Pos)
#define PWM_CLK_PREA_GET(value) GET_FIELD(value, PWM_CLK_PREA_Msk, PWM_CLK_PREA_Pos)
#define PWM_CLK_PREB_GET(value) GET_FIELD(value, PWM_CLK_PREB_Msk, PWM_CLK_PREB_Pos)


// pwm.c does not provide interface to fetch clock, so use low level component_pwm macros
u32 platform_pwm_get_clock( unsigned id )
{
	u32 pre;
  u32 div;
  u32 res = 0;

  if (pwm_id_is_pwm(id)) {
    pre = PWM->PWM_CH_NUM[id].PWM_CMR & PWM_CMR_CPRE_Msk;  // Channel clock prescaler
  
//  printf("PWM get clock: channel_pre = %lu", pre);
  
    switch (pre)
    {
      case PWM_CMR_CPRE_CLKA:
        div = PWM_CLK_DIVA_GET(PWM->PWM_CLK);
//       printf(" clocka div = %lu", div);
        if (div)  // if div=0 then clock not set, so return 0
          {
          pre = PWM_CLK_PREA_GET(PWM->PWM_CLK);
//          printf(" clocka pre = %lu\n", pre);
          if (pre < PWM_CLOCK_PRE_MAX)
            res = freq_from_prescaler(pre)/ div;
//        res = (PWM_MAX_CLOCK / pwm_prescalers( pre ))/ div;
          Assert(freq_from_prescaler(pre) == (PWM_MAX_CLOCK / pwm_prescalers( pre )));
          // FIXME: Just for testing to check math
          }
        break;
      case PWM_CMR_CPRE_CLKB:
        div = PWM_CLK_DIVB_GET(PWM->PWM_CLK);
        if (div)  // if div=0 then clock not set, so return 0
          {
          pre = PWM_CLK_PREB_GET(PWM->PWM_CLK);
          if (pre < PWM_CLOCK_PRE_MAX)
            res = freq_from_prescaler(pre)/ div;
          }
        break;
      default:
        if (pre < PWM_CLOCK_PRE_MAX)
          res = freq_from_prescaler(pre) ;  // divisor of MCK
    }
  } else {
#ifdef TIMER_PWM
    return tc_pwm_get_clock(id);
#endif  
  }
  return res;

//  return pwm_chan_clock[id];
}


