ecdr/elua/src/platform/sam34/platform.c
/* 
 TODO: PWM Clock allocation -
 If ask for a clock already available (one of prescaller dividers, or matches clocka or b) - then give them that
 Otherwise either allocate custom clock or give them a prescaller clock
   Greedy - Give custom clock if one available
  Keep track of what channels using what clock
    If no channels using a custom clock, then consider it available for (re)use
    Use count

  Problem - eLua won't let me feed it a 0 frequency
  
  if clock == 0
    unuse previous clock;
  
  if clock == clocka
    Add another user of clocka
  if clock == clockb
    Add another user of clockb
  prescale = pwm_find_clock_prescaler(clock);
  if (freq_from_pre(prescaler) == clock )
    add user of appropriate division
  if clocka available
    use it
  if clockb available
    use it
  Make do with closest match
    how close is prescaler vs clocka vs clockb
 */

// Set the PWM clock
u32 platform_pwm_set_clock( unsigned id, u32 clock )
{
  platform_pwm_stop(id);
  if (pwm_id_is_pwm(id)) {
    if (clock)
    {
      // FIXME: Should disable any active PWM channels before setting clock
      // FIXME: Allow use clockb and fixed divisors
      //  e.g. keep track of clock value settings (and accept 2 different values, plus using divisions of mck)
      pwm_clock.ul_clka = clock;
      pwm_clock.ul_clkb = 0;          // FIXME: Should already be 0, but just to be sure
      pwm_clock.ul_mck = CPU_FREQUENCY;
      if(pwm_init(PWM, &pwm_clock))
        return 0;
      // FIXME: Need to find out what clock actually set

      if (pwm_chan_clock[id] == 0) pwm_clka_users++;        // Increment use count if wasn't already using
      
      // FIXME: Returns wrong value 
      // *** Problem is it doesn't assign a clock to channel until init channel, 
      // so although clocka is set, we are reading giberish.
      // (So why is it returning system clock value?)
      
      pwm_chan_clock[id] = platform_pwm_get_clock(id);
      pwm_chan_pre[id] = PWM_PRE_CLOCKA;
    }
    else
      if (pwm_chan_clock[id])           // Clearing clock on channel that was in use
      {
      pwm_chan_clock[id] = 0;
      pwm_clka_users--;         // FIXME: Should reduce count for a or b depending which was in use
      }
    Assert(pwm_clka_users < NUM_PWM);
  }
#ifdef TIMER_PWM
  else
    return tc_pwm_set_clock(id, clock);
#endif
  return pwm_chan_clock[id];
//  return clock; // FIXME - what is it supposed to return?
}



static pwm_channel_t pwm_inst;

// TODO: Check how other platforms work, should there be way to change duty cycle without having to restart?


/*
 * Configure a PWM channel to run at "frequency" Hz with a duty cycle of
 * "duty" (0-100).  0 means low all the time, 100 high all the time.
 * Return actual frequency set.
 */
//duty - PWM channel duty cycle, specified as integer from 0 to 100 (percent).
u32 platform_pwm_setup( unsigned id, u32 frequency, unsigned duty )
{
//  pwm_channel_t pwm_inst;
  u32 pwmclk;        // base clock frequency for PWM counter
  u32 period;        // number of base clocks per cycle
  u32 duty_clocks;    // number of base clocks to be high (low?) for
  
  if (id >= NUM_PWM || duty > 100 || pwm_chan_clock[id] == 0) return 0;

  if (pwm_id_is_pwm(id)) {
    //Had tried enabling pin after channel init, but some examples showed it before, so trying it here
    if (pwm_enable_pin(id))
      return 0; // Error

    pwmclk = platform_pwm_get_clock( id );
    
    // Compute period and duty period in clock cycles.
    //
    // PWM output wave frequency is requested in Hz, but programmed as a
    // number of cycles of the master PWM clock frequency.
    //
    // Here, we use rounding to select the numerically closest available
    // frequency and return the closest integer in Hz to that.

    // FIXME: from a different platform, check whether for center or left alligned
    period = (pwmclk + frequency/2) / frequency;
    if (period == 0) period = 1;  
    if (period > PWM_MAX_PERIOD) period = PWM_MAX_PERIOD;
    duty_clocks = (period * duty + 50) / 100;

    // For debugging
    //printf("PWM Setup: period = %u, duty clocks = %u\n", period, duty_clocks);

    // Put known value in all the other fields that example did not cover.
    // Or tell it to start whole structure as 0
    // FIXME: Find out right values for all of these
    pwm_inst.b_deadtime_generator = 0;
    pwm_inst.b_pwmh_output_inverted = 0;
    pwm_inst.b_pwml_output_inverted = 0;
    pwm_inst.us_deadtime_pwml = 0;
    pwm_inst.us_deadtime_pwmh = 0;
    pwm_inst.output_selection.b_override_pwmh = 0;
    pwm_inst.output_selection.b_override_pwml = 0;
    pwm_inst.output_selection.override_level_pwmh = 0;
    pwm_inst.output_selection.override_level_pwml = 0;
    pwm_inst.b_sync_ch  = 0;
    pwm_inst.ul_fault_output_pwmh = 0;
    pwm_inst.ul_fault_output_pwml = 0;
    pwm_inst.fault_id = 0;

    // Fields actually covered by examples
    pwm_channel_disable(PWM, pwm_chan[id]);  
    pwm_inst.ul_prescaler = PWM_CMR_CPRE_CLKA;    // FIXME: Should be whichever clock/prescaler selected
    pwm_inst.channel = pwm_chan[id];
    pwm_inst.ul_period = period;
    pwm_inst.ul_duty = duty_clocks;
    pwm_inst.alignment = PWM_ALIGN_LEFT;
    pwm_inst.polarity = PWM_LOW;                // Start low
    if(pwm_channel_init(PWM, &pwm_inst))
      return 0; // Error
    return (pwmclk + period/2) / period;
  }
#ifdef TIMER_PWM
  else
    return tc_pwm_setup(id, frequency, duty);
#endif
  return 0; // Error
}
//  TODO: Other bits from example code - consider
// PWM_CMR_CPRE_CLKB


// TODO: Should there be way to test channel status?
//uint32_t bitmask = pwm_channel_get_status(PWM)


void platform_pwm_start( unsigned id )
{
//  if ( pwm_chan_clock[id] )
  if (pwm_id_is_pwm(id)) 
    pwm_channel_enable(PWM, pwm_chan[id]);
#ifdef TIMER_PWM
  else
    tc_pwm_start(id);
#endif
}


void platform_pwm_stop( unsigned id )
{
  if (pwm_id_is_pwm(id))
    pwm_channel_disable(PWM, pwm_chan[id]);
#ifdef TIMER_PWM
  else
    tc_pwm_stop( id );
#endif
}

