ecdr/elua/src/platform/sam34/platform.c
#undef pwm_prescalers

#endif // NUM_PWM > 0


// *****************************************************************************
// ADC specific functions and variables

#ifdef BUILD_ADC

// 16 ADC channels, plus Temperature


// Pins

//#define PIO_PA3X1_WKUP1      (1u << 3)  /**< \brief Adc signal: AD1/WKUP1 */
//#define PIO_PB21X1_WKUP13    (1u << 21) /**< \brief Adc signal: AD14/WKUP13 */
//#define PIO_PA11B_ADTRG      (1u << 11) /**< \brief Adc signal: ADTRG */

/*  PIOs mapping handled automatically
const struct sam_pin_config adc_pins[] = {
  {PIO_PA2_IDX, (PIO_DEFAULT)}   // AD0
  {PIO_PA3_IDX, (PIO_DEFAULT)}   // AD1
  {PIO_PA4_IDX, (PIO_DEFAULT)}   // AD2
  {PIO_PA6_IDX, (PIO_DEFAULT)}   // AD3
  {PIO_PA22_IDX, (PIO_DEFAULT)}   // AD4
  {PIO_PA23_IDX, (PIO_DEFAULT)}   // AD5
  {PIO_PA24_IDX, (PIO_DEFAULT)}   // AD6
  {PIO_PA16_IDX, (PIO_DEFAULT)}   // AD7
  {PIO_PB12_IDX, (PIO_DEFAULT)}   // AD8
  {PIO_PB13_IDX, (PIO_DEFAULT)}   // AD9
  {PIO_PB17_IDX, (PIO_DEFAULT)}   // AD10
  {PIO_PB18_IDX, (PIO_DEFAULT)}   // AD11
  {PIO_PB19_IDX, (PIO_DEFAULT)}   // AD12
  {PIO_PB20_IDX, (PIO_DEFAULT)}   // AD13
  {PIO_PB21_IDX, (PIO_DEFAULT)}   // AD14
  };
*/

// FIXME: fix ADC_TIMER_IDs (they are arbitrarily set for now)
#define ADC_TIMER_FIRST_ID 8
#define ADC_NUM_TIMERS 1

/** Reference voltage for ADC, in mv. */
#define VOLT_REF        (3300)

// Could be useful const (either this or # bits)
#define MAX_DIGITAL     (4095)


// TODO: See what did with LM4F on temperature sensor

// Temperature sensor - channel 15, 0 to 3.3 v, hence ADVREF must be set to 3300mv
// TSON bit in ADC_ACR
//		f_temp = (float)(l_vol - 800) * 0.37736 + 27.0;

// Constant: THERMOMETER
#define ADC_THERM_ID  ADC_TEMPERATURE_SENSOR


/*
static enum adc_channel_num_t adc_channel(unsigned id)
{
  return id;
}
*/

int platform_adc_check_timer_id( unsigned id, unsigned adc_timer_id )
{
  return ( ( adc_timer_id >= ADC_TIMER_FIRST_ID ) && ( adc_timer_id < ( ADC_TIMER_FIRST_ID + ADC_NUM_TIMERS ) ) );
}


// Given ADC reading taged with channel number - get just the channel number
static inline u8 chan_num(u32 adc_val)
{
  return ((adc_val & ADC_LCDR_CHNB_Msk) >> ADC_LCDR_CHNB_Pos);
}


// FIXME: Incomplete

// Handle ADC interrupts
void ADC_Handler( void )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  elua_adc_ch_state *s = d->ch_state[ d->seq_ctr ]; // FIXME: This is almost shurely wrong

	uint32_t i;
	uint32_t adctemp;
	uint8_t ch_num;

  if ((adc_get_status(ADC) & ADC_ISR_DRDY) == ADC_ISR_DRDY) {
		adctemp = adc_get_latest_value(ADC);
    ch_num = chan_num(adctemp);
  
//  for (d->seq_ctr = 0; d->seq_ctr < d->seq_len ; d->seq_ctr++ )
//   s = d->ch_state[ d->seq_ctr ];
//    get fresh data for s, or if data available for s

    // Need to fetch data from any channels 
UNUSED(i);
UNUSED(ch_num);
  
/*
		for (i = 0; i < NUM_CHANNELS; i++) {
      if (g_adc_sample_data.uc_ch_num[i] == ch_num) {
				g_adc_sample_data.us_value[i] = (temp & ADC_LCDR_LDATA_Msk);
				g_adc_sample_data.us_done |= 1 << i;
			}
		}
*/

    s->value_fresh = 1;

    if ( s->logsmoothlen > 0 && s->smooth_ready == 0)
      adc_smooth_data( s->id );
#if defined( BUF_ENABLE_ADC )
    else if ( s->reqsamples > 1 )
    {
      buf_write( BUF_ID_ADC, s->id, ( t_buf_data* )s->value_ptr );
      s->value_fresh = 0;
    }
#endif

    // If we have the number of requested samples, stop sampling
    if ( adc_samples_available( s->id ) >= s->reqsamples && s->freerunning == 0 )
      platform_adc_stop( s->id );
      
  };

  // Only attempt to refresh sequence order if still running
  // This allows us to "cache" an old sequence if all channels
  // finish at the same time
  if ( d->running == 1 )
    adc_update_dev_sequence( 0 );

  if ( d->clocked == 0 && d->running == 1 )
  {
    // Need to manually fire off sample request in single sample mode
//    MAP_ADCProcessorTrigger( ADC_BASE, d->seq_id );
  }    
}
//ADC_ISR_DRDY
//ADC_ISR_RXBUFF

//			while ((adc_get_status(ADC) & ADC_ISR_DRDY) != ADC_ISR_DRDY);
//			ulValue = adc_get_latest_value(ADC);
 
 
// 		adc_read_buffer(ADC, gs_s_adc_values, BUFFER_SIZE)
//  	adc_enable_interrupt(ADC, ADC_ISR_RXBUFF);



static void adcs_init( void )
{
  unsigned id;
//  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
	pmc_enable_periph_clk(ID_ADC);

#ifdef ADC_TEMP  
  // TODO: constant for ADC channel #
  
	/* Enable channel for temperature sensor. */
	adc_enable_channel(ADC, ADC_TEMPERATURE_SENSOR);

	/* Enable the temperature sensor. */
	adc_enable_ts(ADC);
#endif //ADC_TEMP

//  adc_enable_channel( ADC, ulChannel );

  for( id = 0; id < NUM_ADC; id ++ )
    adc_init_ch_state( id );

// Should set ADC int priority also

  /* Enable Data ready interrupt. */
  adc_enable_interrupt(ADC, ADC_IER_DRDY);

  /* Enable ADC interrupt. */
  NVIC_EnableIRQ(ADC_IRQn);

  // Perform sequencer setup
  platform_adc_set_clock( 0, 0 );
}


	/*
	 * Formula: ADCClock = MCK / ( (PRESCAL+1) * 2 )  [PRESCAL 0 to 255 ]
	 * For example, MCK = 64MHZ, PRESCAL = 4, then:
	 *     ADCClock = 64 / ((4+1) * 2) = 6.4MHz;
 	 */

   /*
    * MCK = 80MHZ, prescal = 4 -> ADC clock = 8 MHz
    * Settling time = 3 / 8 MHz = 375 ns (Min is 200 ns) 
    */
   /*
    *   [settling 0 = 3/  ADC clock (15 MHz or less), 
    *   [settling 1 = 5/  ADC clock (25 MHz or less),
    *   [settling 2 = 9/  ADC clock (45 MHz or less), // So this should work with any prescaler on 80Mhz part
    *   [settling 3 = 17/ ADC clock (85 Mhz or less)
    *   ADC clock limit = n/200 ns -> ADC clock * 200 ns = n, then look for next larger n
    *  settling[] = {3, 5, 9, 17}
    *  setl = ADC clock / 5000000; // (same as * 200 ns)
    *  look up setl in settling, return the index in settling (0, 1, 2, 3)
    */
   // Sampling freq 0.05 to 1 MHz
   // t Startup (Off to normal 30 us typ, 40 us max; Standby to normal 8 us typ, 12 us max)
   //   startup value = ADCClock * 40 us (for off, or 12 us for standby)
   // track time - min 160 ns
   //  TRACKTIM = ( 160 ns * ADCClock ) - 1
   // t convert typ 20 T CP_ADC
   // t settle - min 200 ns
// What limit on transfer time?

// Minimum tracking time - 160 ns
#define MIN_TRACK  (0.000000160)
#define MIN_SETTLE (0.000000200)

