ecdr/elua/src/platform/sam34/platform.c
// FIXME: 40 microseconds (may actually only need 12 us)
#define MAX_STARTUP (0.000040)


	/* Set ADC clock. */
	/* Formula:
	 *     Startup  Time = startup value / ADCClock
	 *     Transfer Time = (TRANSFER * 2 + 3) / ADCClock
	 *     Tracking Time = (TRACKTIM + 1) / ADCClock
	 *     Settling Time = settling value / ADCClock
	 * For example, ADC clock = 6MHz (166.7 ns)
	 *     Startup time = 512 / 6MHz = 85.3 us
	 *     Transfer Time = (1 * 2 + 3) / 6MHz = 833.3 ns
	 *     Tracking Time = (0 + 1) / 6MHz = 166.7 ns
	 *     Settling Time = 3 / 6MHz = 500 ns
	 */
	/* Initialize ADC. */
	/*  startup = 8:    512 periods of ADCClock
	 * for prescale = 4
	 *     prescale: ADCClock = MCK / ( (PRESCAL+1) * 2 ) => 64MHz / ((4+1)*2) = 6.4MHz
	 *     ADC clock = 6.4 MHz
	 */

u32 platform_adc_set_clock( unsigned id, u32 frequency )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  u32 tracktime;
  
  if ( frequency > 0 )
  {
    d->clocked = 1;
    u8 pre = (CPU_FREQUENCY/frequency / 2) - 1;
    u32 adcClock = CPU_FREQUENCY / ((pre + 1) * 2);
    uint8_t startup = MAX_STARTUP * adcClock;

    //  adc_init(ADC, CPU_FREQUENCY, 6400000, 8 );
    adc_init(ADC, CPU_FREQUENCY, frequency, startup );

    tracktime = ( MIN_TRACK * adcClock ) - 1;
    
    adc_configure_timing(ADC, tracktime, ADC_SETTLING_TIME_2, 1); // track time, settle time, transfer time
    // Examp had settling time 3 (not sure why)
    // Why were tracking time 0, transfer time 1 in example?

//	adc_configure_trigger(ADC, ADC_TRIG_SW, 0);  // ADC_TRIG_TIO_CH_0-2

  // Checks ADC settings, prints error messages if problems
    adc_check(ADC, CPU_FREQUENCY);
    
    adc_configure_trigger(ADC, ADC_TRIG_SW, 0);	/* Disable hardware trigger. */ 

    frequency = adc_get_actual_adc_clock(ADC, CPU_FREQUENCY);
  }
  else
  {
    d->clocked = 0;
    // Conversion will run back-to-back until required samples are acquired
    adc_configure_trigger(ADC, ADC_TRIG_SW, 1);
  }
  
	/* Enable channel number tag. */
	adc_enable_tag(ADC);

  return frequency;
}


enum adc_channel_num_t ch_list[NUM_ADC] = { 0 };


int platform_adc_update_sequence( void )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );

  // For each channel in sequence
  for (d->seq_ctr = 0; d->seq_ctr < d->seq_len-1 ; d->seq_ctr++)
  {
    adc_enable_channel( ADC, d->ch_state[ d->seq_ctr ]->id );
    // Pin config happens automatically
    ch_list[d->seq_ctr] = d->ch_state[ d->seq_ctr ]->id;
  }

  /* Set user defined channel sequence. */
  adc_configure_sequence(ADC, ch_list,  d->seq_len);
  
  d->seq_ctr = 0;
  return PLATFORM_OK;
}


int platform_adc_start_sequence( void )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  if( d->running != 1 ) // If already running, changes will be picked up at interrupt
  {
    adc_update_dev_sequence( 0 );

    d->running = 1;
    if( d->clocked == 1 )
    {
//      MAP_TimerControlTrigger(timer_base[d->timer_id], TIMER_A, true);
//      MAP_TimerEnable(timer_base[d->timer_id], TIMER_A);
    }
    else
    {
//      MAP_ADCProcessorTrigger( ADC_BASE, d->seq_id );
        adc_configure_trigger(ADC, ADC_TRIG_SW, 1);  // Free running
        adc_start(ADC); 	/* Start conversion. */
    }

// FIXME: Not sure where rest of this should go
    /* Enable sequencer. */
    adc_start_sequencer(ADC);
  }
  
  return PLATFORM_OK;
}

void platform_adc_stop( unsigned id )
{
  elua_adc_ch_state *s = adc_get_ch_state( id );
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  s->op_pending = 0;
  INACTIVATE_CHANNEL(d, id);
  
  // If there are no more active channels, stop the sequencer
  if( d->ch_active == 0 )
  {
    adc_stop_sequencer(ADC);
    d->running = 0;
  }

//	adc_disable_channel(ADC, adc_channel(id));
//  adc_stop(ADC);
}

#endif // ifdef BUILD_ADC


// ****************************************************************************
// Support for specific onboard devices 

// ****************************************************************************
// Ethernet functions
#ifdef BUILD_UIP

#warning Ethernet - platform driver not written.

#endif // BUILD_UIP


// ****************************************************************************
// USB functions

// TODO: Clean up (remove extra functions)

// TODO: see if can get CDC_STDIO working (works with USB CDC)
//   CDC_STDIO - get unrecognized device, with VID and PID 0

#if defined( BUILD_USB_CDC )

static void usb_init( void )
{
// From stdio_usb example
  	// Initialize interrupt vector table support.
	irq_initialize_vectors();

	// Enable interrupts
	cpu_irq_enable();

#ifdef USB_CDC_STDIO  
  stdio_usb_init();
#else  
	// Initialize the sleep manager
//	sleepmgr_init();
  
  udc_start();
// * Add to the main IDLE loop:
// *     sleepmgr_enter_sleep(); // Optional

#endif  
}

#ifdef USB_CDC_STDIO

#warning building USB_CDC_STDIO - this does not work yet

void platform_usb_cdc_send( u8 data )
{
//  putchar(data);
  printf("%c", data);   // FIXME: Probably simpler function to use - copied this from example
}

int platform_usb_cdc_recv( timer_data_type timeout )
{
  char ch;
  
//  return getchar();
  scanf("%c",&ch);    // FIXME: Probably simpler function to use - copied this from example
  return ch;
}

#else


static volatile bool platform_cdc_enable_flag = false;

  
void platform_usb_cdc_send( u8 data )
{
  if (platform_cdc_enable_flag)
  {
    if (!udi_cdc_is_tx_ready()) {
			// Fifo full
			udi_cdc_signal_overrun();
		} else {
      udi_cdc_putc(data);
    };
  };
}


int platform_usb_cdc_recv( timer_data_type timeout )
{
  if (platform_cdc_enable_flag){
    if (0 == timeout)
      if (udi_cdc_is_rx_ready())  // No waiting - so get character if available
        return udi_cdc_getc();   
      else
        return -1;      // No character available, so return immediately (FIXME: Check return value)
    else
      return udi_cdc_getc();    // FIXME: Need to implement a timeout on this wait
  } else 
    return -1;
}


// TODO: Most of these callbacks are not needed - copied from example, but do nothing, could get rid of
void platform_suspend_action(void)
{
//	ui_powerdown();
}

