ecdr/elua/src/platform/sam34/platform.c
void platform_resume_action(void)
{
//	ui_wakeup();
}

void platform_sof_action(void)
{
	if (!platform_cdc_enable_flag)
		return;
//	ui_process(udd_get_frame_number());
}

bool platform_cdc_enable(void)
{
	platform_cdc_enable_flag = true;
//	platform_port_open = 0;
	return true;
}

void platform_cdc_disable(void)
{
	platform_cdc_enable_flag = false;
}

void platform_cdc_set_dtr(bool enable)
{
	if ( enable ) {
		// Host terminal has open COM
//		platform_port_open |= 1 << port;
//		ui_com_open(port);
	}else{
		// Host terminal has close COM
//		platform_port_open &= ~(1 << port);
//		ui_com_close(port);
	}
}


void platform_cdc_rx_notify(void)
{
// TODO: Could do some buffering, or something
}


#endif // USB_CDC_STDIO

#else

// Callbacks needed even when don't use USB - just to make the library happy
// TODO: Could remove if build system would not build the USB library when not asked for

bool platform_cdc_enable(void)
{
  return true;
}

void platform_cdc_disable(void)
{
}

void platform_cdc_rx_notify(void)
{
}

#endif // BUILD_USB_CDC


// ****************************************************************************
// Flash access functions

#ifdef BUILD_WOFS

#warning WOFS not tested

// INTERNAL_FLASH_START_ADDRESS, INTERNAL_FLASH_SIZE
#ifdef IFLASH0_SIZE
#define IFLASH0_END (IFLASH0_ADDR + IFLASH0_SIZE)
#endif

#ifdef IFLASH1_SIZE
#define IFLASH1_END (IFLASH1_ADDR + IFLASH1_SIZE)
#endif

// Wait cycles copied from example
#define FLASH_WAIT_CYCLES 6

// FIXME: Should use an enum, or some other way to designate multiple flash banks
#define IFLASH0 1
#define IFLASH1 2

/* Unlock entire flash
	ul_error = flash_unlock(IFLASH_ADDR, (IFLASH_ADDR + IFLASH_SIZE - 1), 0, 0);
	if (FLASH_RC_OK != ul_error) {
		puts("Unlock internal flash failed.\r\n");
		return 0;
	}
  */
  
int platform_flash_init( void )
{
 // Set access mode, wait cycles
  return (flash_init(FLASH_ACCESS_MODE_128, FLASH_WAIT_CYCLES) == FLASH_RC_OK) 
    ? PLATFORM_OK : PLATFORM_ERR;
}

static u8 flash_bank(u32 addr)
{
  if ((IFLASH0_ADDR <= addr) && (addr <= IFLASH0_END))
    return IFLASH0;
  if ((IFLASH1_ADDR <= addr) && (addr <= IFLASH1_END))
    return IFLASH1;   // FIXME: Need to define return values
  return PLATFORM_ERR;
}

// TODO: Check for crossing bank boundary (and handle appropriately)
u32 platform_s_flash_write( const void *from, u32 toaddr, u32 size )
{
  u32 result;

 if ( flash_bank(toaddr) != flash_bank(toaddr + size))
    return PLATFORM_ERR;  // FIXME: Really should do in 2 parts
	result = flash_write(toaddr, from, size, 1);  // Last arg - 1 if erase first
  return (result == FLASH_RC_OK) ? PLATFORM_OK : PLATFORM_ERR;
}

int platform_flash_erase_sector( u32 sector_id )
{
//  return (flash_erase_sector(sector_id) == FLASH_RC_OK) ? PLATFORM_OK : PLATFORM_ERR;
// FIXME: ?? Thought from example that above would be code, but not defined for SAM3X??
  return PLATFORM_ERR;
}

#endif // #ifdef BUILD_WOFS


// ****************************************************************************
// Platform specific shell command(s)
#if defined(BUILD_SHELL_REFLASH)

#include "shell.h"


static void restart_bootloader(void)
{
  flash_clear_gpnvm(1);   // Next time boot from ROM

  // reset processor and periphirals (register address from cmsis)
  asm ("dsb"); // Ensure completion of memory access
  // reboot - set key, reset perrst (peripherals) and procrst (processor)
  REG_RSTC_CR = RSTC_CR_KEY(0xa5) | RSTC_CR_PERRST | RSTC_CR_PROCRST;
  asm ("dsb"); // Ensure completion of memory access
  while (1);  // Wait for reset

  //  NVIC_SystemReset();     // This way of doing reset did not work (to make it boot from ROM)
}


const char shell_help_reflash[] = "\n"
  "Restart to the bootloader, ready to flash new program.\n";
const char shell_help_summary_reflash[] = "back to bootloader";

void platform_shell_reflash( int argc, char **argv )
{
  if( argc != 1 )
  {
    SHELL_SHOW_HELP( reflash );
    return;
  }
  printf( "Reflash - restarting from ROM bootloader\n" );

  restart_bootloader();
}


#endif


// ****************************************************************************
// Platform specific modules go here


// ****************************************************************************
// Random sequence generator

#ifdef BUILD_RAND

#include "module_rand.h"

// TODO: Add buffer (so can generate ahead of need)
// TODO: Add interface to check if number available

// Indicate if need to arrange to call rand_init - maybe should just call in system init(?)
static u8 f_rand_init = false;

#ifdef RAND_BUF

#warning Rand buffer not finished

//static u8 buf_space = true;
//static u32 rand_buffer;

static fifo_desc_t rand_fifo;

#define RAND_BUF_SIZE 16

static u8 rand_buf[RAND_BUF_SIZE];

void TRNG_Handler(void)
{
	u32 status;
  u32 rand; // make this a union (u32 and array of u8)

  status = trng_get_interrupt_status(TRNG);
  
  if ((status & TRNG_ISR_DATRDY) == TRNG_ISR_DATRDY) {
    if (fifo_is_full(&rand_fifo))
      disable TRNG interrupt
    else {
      rand = trng_read_output_data(TRNG)
      for (i = 0; i < 4; i++)
        if (fifo_push_uint8(&rand_fifo, rand[i]) == FIFO_ERROR_OVERFLOW){
          disable TRNG int
          break;
        }
    }
  }
  
/*  if (buf_space)
  {
    if ((status & TRNG_ISR_DATRDY) == TRNG_ISR_DATRDY) {
      buf_space = false;
      rand_buffer = trng_read_output_data(TRNG);
    }
  }
 */
  
}
#endif


u8 platform_rand_init( void )
{
  if ( !f_rand_init ) {
    pmc_enable_periph_clk(ID_TRNG);
    trng_enable(TRNG);

	/* Enable TRNG interrupt */
  /*
	NVIC_DisableIRQ(TRNG_IRQn);
	NVIC_ClearPendingIRQ(TRNG_IRQn);
	NVIC_SetPriority(TRNG_IRQn, RAND_INT_PRI);
	NVIC_EnableIRQ(TRNG_IRQn);
	trng_enable_interrupt(TRNG);
 */
#ifdef RAND_BUF
    if (fifo_init(&rand_fifo, rand_buf, RAND_BUF_SIZE) == FIFO_ERROR)
      return FALSE;
#endif
    f_rand_init = true;    
  }
  return TRUE;
}

// TODO: Fetch given number bytes from random sequence next(n) 
u32 platform_rand_next( void )
{
  if ( !f_rand_init )
    platform_rand_init();

  WAIT_WHILE(!trng_get_interrupt_status(TRNG));
  return trng_read_output_data(TRNG);
}


#endif // BUILD_RAND
